
#ifndef __EXCEPTION_H_
#define __EXCEPTION_H_

#ifdef __cplusplus  
extern "C" {
#endif

/*================== 头文件包含			=========================================*/
#include <stdint.h>
#include <stdbool.h>

/*================== 宏定义声明			=========================================*/
/*================== 数据类型声明		=========================================*/
//struct enum union

/*================== 外部变量声明		=========================================*/
//extern

/*================== 外部函数声明		=========================================*/

void SetupExceptionHandler();
#ifdef __cplusplus
}
#endif

#endif /*__EXCEPTION_H_*/
